{
  "data": [
    {
      "id": "MDEwOlJlcG9zaXRvcnkzNDE0MDkzNjU=",
      "name": "Stock-recommandation-via-machine-learning-algorithms",
      "createdAt": "2021-02-23T02:58:17Z",
      "url": "https://github.com/WideSu/Stock-recommandation-via-machine-learning-algorithms",
      "description": "I utilized some supervised machine learning models to choose stocks, such as Logistic Regression, Random Forest, and Support Vector Machine.  With these models, I can predict the stock’s 60 days’ return rate. If a specific stock outperformed the average return rate, the model would recommend holding the position. The data is from stocks of the listed companies in China from Tushare’ API, which is a financial data platform.",
      "isFork": false,
      "languages": [
        {
          "name": "Python",
          "iconifyClass": "logos-python"
        },
        {
          "name": "Jupyter Notebook",
          "iconifyClass": "logos-jupyter"
        }
      ]
    },
    {
      "id": "R_kgDOHGkh-Q",
      "name": "CS606_ITC",
      "createdAt": "2022-04-01T09:14:41Z",
      "url": "https://github.com/WideSu/CS606_ITC",
      "description": "The university timetabling is a classical combinatorial optimization problem that takes a large number of variables and constraints into account. Student allocating and class scheduling decisions need to be made jointly against the backdrop of classroom and timeslot penalty and subject to practical rules. We model this problem as a two-stage mixed integer program which search for a feasible solution at the start and graduately improve from it iteratively, which reduced the time to get optimal solution by 58\\%. Besides, we used a constraint programming method with the same objective function and constraints and compared the results for the two methods on 2019 ITC datasets. A comparison with results reported in this passage shows that the MIP approach outperformed the constraint programming approach in faster speed and better solution.",
      "isFork": false,
      "languages": [
        {
          "name": "Jupyter Notebook",
          "iconifyClass": "logos-jupyter"
        },
        {
          "name": "Python",
          "iconifyClass": "logos-python"
        }
      ]
    },
    {
      "id": "R_kgDOGu5JKg",
      "name": "CreditRiskDetection",
      "createdAt": "2022-01-25T10:01:26Z",
      "url": "https://github.com/WideSu/CreditRiskDetection",
      "description": "Used 4 machine learning models namely Logistic Regression, SVM, Random Forest and LGBM and one deep learning model namely DeepFM to classify whether an applicant is capable to pay a loan.",
      "isFork": false,
      "languages": [
        {
          "name": "Jupyter Notebook",
          "iconifyClass": "logos-jupyter"
        },
        {
          "name": "Python",
          "iconifyClass": "logos-python"
        }
      ]
    },
    {
      "id": "MDEwOlJlcG9zaXRvcnkzMTUyNDk3Mzg=",
      "name": "Data-Science-Tutorial",
      "createdAt": "2020-11-23T08:36:30Z",
      "url": "https://github.com/WideSu/Data-Science-Tutorial",
      "description": "This is a repo of notes and projects I have done for seeking a python developer / machine learning engineer job in big tech company next year. It includes Algorithms on LeetCode, SQL in HackerRank, and tricks in Python.",
      "isFork": false,
      "languages": [
        {
          "name": "Python",
          "iconifyClass": "logos-python"
        },
        {
          "name": "Jupyter Notebook",
          "iconifyClass": "logos-jupyter"
        }
      ]
    }
  ]
}
